# --- Настройки игры ---

ADMIN_ID = 1206312310

CLASSES = {
    "Ассасин": {"atk": 15, "dex": 20, "luck": 25, "hp": 100, "passive": "Крит. удар +8%"},
    "Авангард": {"atk": 10, "dex": 10, "luck": 10, "hp": 200, "passive": "Снижение урона -10%"},
    "Маг": {"atk": 25, "dex": 8, "luck": 15, "hp": 80, "passive": "+10% к урону, -5% защиты"},
    "Паладин": {"atk": 12, "dex": 8, "luck": 5, "hp": 250, "passive": "Лечение +5% за раунд"}
}

DUNGEONS = {
    "Катакомбы": {"lvl": 1, "exp": 50, "gold": 100},
    "Забытый склеп": {"lvl": 10, "exp": 250, "gold": 500},
    "Логово дракона": {"lvl": 50, "exp": 2000, "gold": 5000}
}

TOKEN = '8840112637:AAHKDM7xiUQlw9c4o_z79dTeIqs4jJtWLVc'
